           05 NUM-CONTA           PIC 9(08).   
           05 NOME-CLIENTE        PIC A(30).   
           05 AGENCIA             PIC 9(04).   
           05 TIPO-CONTA          PIC A(01).   
           05 SALDO               PIC 9(09)V99.