       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJETO4.
       AUTHOR. CAIO FELIPE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CONTA ASSIGN TO UT-S-CONTA.
           SELECT ARQ-RELAT ASSIGN TO UT-S-RELAT.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-CONTA
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 54 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS REG-CONTA.
       01  REG-CONTA COPY REGCONTA.

       FD  ARQ-RELAT
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 132 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS REG-RELAT.
       01  REG-RELAT              PIC X(132).

       WORKING-STORAGE SECTION.
       01 WS-VARIAVEIS COPY WRKP4.
       01 WS-RELATORIO COPY RELP4.

       PROCEDURE DIVISION.
       0000-PRINCIPAL.
           PERFORM 0100-INICIAR.
           PERFORM 0200-PROCESSAR
              UNTIL WKR-FIM-ARQ = 'S'.
           PERFORM 0900-FINALIZAR.
           STOP RUN.

       9999-COPY-ROTINAS.
           COPY ROTP4.
